vue-workshop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-07 Tue 21:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vue.js + Quasar</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mathias (mbr)" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Vue.js + Quasar</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb355c58">1. Introduction</a>
<ul>
<li><a href="#org74269fb">1.1. The directives</a></li>
<li><a href="#org3045680">1.2. The Vue instance</a></li>
</ul>
</li>
<li><a href="#org2d90118">2. Assignments</a>
<ul>
<li><a href="#orge248590">2.1. Task</a></li>
<li><a href="#org64c96e3">2.2. Task</a></li>
<li><a href="#org93b57f7">2.3. Task (extra)</a></li>
</ul>
</li>
<li><a href="#org0af1ca0">3. Resources</a>
<ul>
<li><a href="#orgff951a0">3.1. What is what</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb355c58" class="outline-2">
<h2 id="orgb355c58"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org74269fb" class="outline-3">
<h3 id="org74269fb"><span class="section-number-3">1.1</span> The directives</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><b>v-model</b> two way binding</li>
<li><b>: (or v-bind:)</b> one way binding used with attributes</li>
<li><b>@ (or v-on:)</b> catch event</li>
<li><b>v-if</b> logical render</li>
<li><b>v-else-if</b> used on v-if siblings</li>
<li><b>v-else</b> used on v-if siblings</li>
<li><b>v-for</b> loops</li>
<li><b>v-show</b> display: none</li>
</ul>
</div>
</div>

<div id="outline-container-org3045680" class="outline-3">
<h3 id="org3045680"><span class="section-number-3">1.2</span> The Vue instance</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><b>el</b> the element in the DOM we bind the Vue instance to</li>
<li><b>data</b> the data in our instance</li>
<li><b>methods</b> methods that manipulate our data</li>
<li><b>computed</b> cached computed properties of our data.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2d90118" class="outline-2">
<h2 id="org2d90118"><span class="section-number-2">2</span> Assignments</h2>
<div class="outline-text-2" id="text-2">
<p>
We have a super slow environment, so we will be working with fiddles - it's a great playground.
<a href="https://jsfiddle.net/bonqus/z21jds04/">jsfiddle</a>
</p>
</div>
<div id="outline-container-orge248590" class="outline-3">
<h3 id="orge248590"><span class="section-number-3">2.1</span> Task</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Each time you press the 'Increment' btn a new color class should be bound to the BOX.</li>
<li>Create a new btn and a new data field containing a boolean, each time you press the new btn the BOX should appear/disappear.</li>
<li>Render a vertical list of all the items in 'anArray'. Use the v-for directive.</li>
<li>Render the color of each item as the background for that row.</li>
<li>Create a btn for each item called delete.</li>
<li>If you press the delete btn, that item should be removed.</li>
</ol>
</div>
</div>
<div id="outline-container-org64c96e3" class="outline-3">
<h3 id="org64c96e3"><span class="section-number-3">2.2</span> Task</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Create a new empty list, and a method that pushes a random color to that list, use the function below.</li>
<li>Create a btn that triggers your method.</li>
<li>Render a vertical list and the corresponding background, use the style attribute.</li>
<li>Create an input where you can write a color.</li>
<li>Create a btn that pushes the value of the input to your list and clears the input afterwards.</li>
<li>Add a delete btn for each item in the list.</li>
</ol>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #A3BE8C;">"#"</span> + Math.floor<span style="color: #8FBCBB;">(</span>Math.random<span style="color: #88C0D0;">()</span>*<span style="color: #81A1C1;">16777215</span><span style="color: #8FBCBB;">)</span>.toString<span style="color: #8FBCBB;">(</span><span style="color: #81A1C1;">16</span><span style="color: #8FBCBB;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org93b57f7" class="outline-3">
<h3 id="org93b57f7"><span class="section-number-3">2.3</span> Task (extra)</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<b>TODO APP requirements</b>
</p>
<ul class="org-ul">
<li>See a list of tasks that are todo</li>
<li>See a list of tasks that are done</li>
<li>Add tasks</li>
<li>Delete tasks</li>
<li>Mark tasks as done</li>
</ul>

<p>
Some quasar components you might find handy, but don't limit your self it's a huge library. 
</p>
<ul class="org-ul">
<li>q-list</li>
<li>q-item</li>
<li>q-checkbox</li>
<li>q-btn</li>
<li>q-input</li>
<li>q-dialog (a popup 'Are you sure you want to delete this task?')</li>
</ul>

<p>
<a href="https://jsfiddle.net/bonqus/esbdopaf/">A quick starter</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org0af1ca0" class="outline-2">
<h2 id="org0af1ca0"><span class="section-number-2">3</span> Resources</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgff951a0" class="outline-3">
<h3 id="orgff951a0"><span class="section-number-3">3.1</span> What is what</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://vuejs.org/v2/guide/">Vue.js</a> is a js framework.</li>
<li><a href="https://quasar.dev/">Quasar</a> is a framework on top of Vue.js, we use it for its components.</li>
<li><a href="https://vuex.vuejs.org/">Vuex</a> is a global data store for your application. You can store, get and mutate data, it works atomically.</li>
<li><a href="https://github.com/axios/axios">Axios</a> is a js library used to make HTTP(S) requests.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mathias (mbr)</p>
<p class="date">Created: 2020-04-07 Tue 21:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
